CS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-23 Mo 20:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Informatik</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="silin" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Informatik</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga2ced08">Functional Programm of Haskell</a>
<ul>
<li><a href="#org1a3bd92">Grundlage</a></li>
<li><a href="#orgcebf561">Pattern Matching</a></li>
<li><a href="#orgf4182ee">Alternativen</a></li>
<li><a href="#org9d8a3a0">Recursion</a></li>
<li><a href="#org42b308f">type conversion</a></li>
<li><a href="#orgb713382">Factorial</a></li>
<li><a href="#org5d02778">Stern Brocot Floge</a></li>
</ul>
</li>
<li><a href="#org1010993">Schaltnetze</a></li>
<li><a href="#org3e2c907">Hash</a></li>
<li><a href="#orgb65efc5">P &amp; NP</a>
<ul>
<li><a href="#org6830193">def</a></li>
<li><a href="#org4ce4bea">NP</a></li>
</ul>
</li>
<li><a href="#org199b848">Algotithm</a>
<ul>
<li><a href="#org5010445">Komplexitätstheorie</a>
<ul>
<li><a href="#org848ef4a">Maximum Sequence Problem Beispile</a></li>
<li><a href="#orgf0a6f59">Landau Symbols</a></li>
<li><a href="#orgdd8a146">Master Theorem</a></li>
</ul>
</li>
<li><a href="#org6c2928a">Tree Theorem</a>
<ul>
<li><a href="#org593a3b8">Vorgänger(u)</a></li>
<li><a href="#orgcb4f0c4">Nachfolger(v)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org47fd5b8">Advanced Algorithms</a>
<ul>
<li><a href="#org0336e2c">Master theorem</a></li>
<li><a href="#orge5128f3">Maximum increasing Subsequence</a>
<ul>
<li><a href="#org07e142b">LCS C++</a></li>
<li><a href="#orgec07688">LCS python</a></li>
<li><a href="#org30fc1a3">Dynamic program C++</a></li>
<li><a href="#orgc0ca6b9">Dynamic Program Python</a></li>
<li><a href="#org7d42da0">O(nlogn) method C++</a></li>
<li><a href="#org526db05">O(nlogn) method Python</a></li>
</ul>
</li>
<li><a href="#orgef7b42c">maximum submatrix</a>
<ul>
<li><a href="#orge4723f2">Brute force solution Python</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga2ced08" class="outline-2">
<h2 id="orga2ced08">Functional Programm of Haskell</h2>
<div class="outline-text-2" id="text-orga2ced08">
</div>
<div id="outline-container-org1a3bd92" class="outline-3">
<h3 id="org1a3bd92">Grundlage</h3>
<div class="outline-text-3" id="text-org1a3bd92">
<p>
basic function call
</p>
<div class="org-src-container">
<pre class="src src-haskell">  log2 <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Float</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Float</span>
  log2 <span style="color: #7590db;">=</span> logBase 2
<span style="color: #bc6ec5; font-weight: bold;">log2</span> 43

</pre>
</div>

<p>
implication
</p>
<div class="org-src-container">
<pre class="src src-haskell">
  (<span style="color: #7590db;">==&gt;</span>)<span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
  a <span style="color: #7590db;">==&gt;</span> b <span style="color: #7590db;">=</span> not a <span style="color: #7590db;">||</span> not b
<span style="color: #ce537a; font-weight: bold;">Flase</span> <span style="color: #bc6ec5; font-weight: bold;">==&gt;</span> <span style="color: #ce537a; font-weight: bold;">True</span>
<span style="color: #ce537a; font-weight: bold;">False</span><span style="color: #bc6ec5; font-weight: bold;">==&gt;</span> <span style="color: #ce537a; font-weight: bold;">False</span>
<span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #bc6ec5; font-weight: bold;">==&gt;</span> <span style="color: #ce537a; font-weight: bold;">True</span>

</pre>
</div>

<p>
&#x2013;euler numbers
</p>
<div class="org-src-container">
<pre class="src src-haskell">
  e<span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Float</span>
    e <span style="color: #7590db;">=</span> exp 1
e 
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcebf561" class="outline-3">
<h3 id="orgcebf561">Pattern Matching</h3>
<div class="outline-text-3" id="text-orgcebf561">
<p>
one of the calling must match one case of pattern
</p>
<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">False</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>


<span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span> <span style="color: #ce537a; font-weight: bold;">True</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-haskell">
(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #4f97d7; font-weight: bold;">_</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">False</span>

(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span>
(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">False</span> <span style="color: #ce537a; font-weight: bold;">True</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
  (<span style="color: #7590db;">&lt;#&gt;</span>) <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>

</pre>
</div>

<p>
case : this can only be executed in a .hs file,
 in orgmode can NOT be imported, I don't know what is going on
 in Terminal can NOT also
</p>

<p>
Here I made above mistake, this is no sense.
so long the indentation is correct, so works
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span>
(<span style="color: #bc6ec5; font-weight: bold;">&lt;#&gt;</span>) a b
  <span style="color: #7590db;">|</span> a <span style="color: #7590db;">==</span> b <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">False</span>
  <span style="color: #7590db;">|</span> otherwise <span style="color: #7590db;">=</span> <span style="color: #ce537a; font-weight: bold;">True</span>


</pre>
</div>
</div>
</div>
