CS.html

<div id="outline-container-orgf4182ee" class="outline-3">
<h3 id="orgf4182ee">Alternativen</h3>
<div class="outline-text-3" id="text-orgf4182ee">
<p>
if else then
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">absolute</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
<span style="color: #bc6ec5; font-weight: bold;">absolute</span> x <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">if</span> x <span style="color: #7590db;">&lt;</span> 0 <span style="color: #4f97d7; font-weight: bold;">then</span> <span style="color: #7590db;">-</span>x <span style="color: #4f97d7; font-weight: bold;">else</span> x

</pre>
</div>
</div>
</div>

<div id="outline-container-org9d8a3a0" class="outline-3">
<h3 id="org9d8a3a0">Recursion</h3>
<div class="outline-text-3" id="text-org9d8a3a0">
<p>
easy fib
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">heronA</span> <span style="color: #7590db;">::</span>(<span style="color: #ce537a; font-weight: bold;">Int</span>, <span style="color: #ce537a; font-weight: bold;">Double</span>) <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span>
<span style="color: #bc6ec5; font-weight: bold;">heronA</span> (n,a)
  <span style="color: #7590db;">|</span> n <span style="color: #7590db;">&gt;</span> 0     <span style="color: #7590db;">=</span> (heronA(n<span style="color: #7590db;">-</span>1,a) <span style="color: #7590db;">+</span> a<span style="color: #7590db;">/</span>heronA(n<span style="color: #7590db;">-</span>1, a))<span style="color: #7590db;">/</span>2
  <span style="color: #7590db;">|</span> otherwise <span style="color: #7590db;">=</span> a

<span style="color: #bc6ec5; font-weight: bold;">absolute</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
<span style="color: #bc6ec5; font-weight: bold;">absolute</span> x <span style="color: #7590db;">=</span> <span style="color: #4f97d7; font-weight: bold;">if</span> x <span style="color: #7590db;">&lt;</span> 0 <span style="color: #4f97d7; font-weight: bold;">then</span> <span style="color: #7590db;">-</span>x <span style="color: #4f97d7; font-weight: bold;">else</span> x

<span style="color: #bc6ec5; font-weight: bold;">heronB</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span>
<span style="color: #bc6ec5; font-weight: bold;">heronB</span> n a
  <span style="color: #7590db;">|</span> n <span style="color: #7590db;">&gt;</span> 0     <span style="color: #7590db;">=</span> (heronB (n<span style="color: #7590db;">-</span>1) a <span style="color: #7590db;">+</span> a<span style="color: #7590db;">/</span>heronB(n<span style="color: #7590db;">-</span>1) a)<span style="color: #7590db;">/</span>2
  <span style="color: #7590db;">|</span> otherwise <span style="color: #7590db;">=</span> a

</pre>
</div>


<p>
where 
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">heronC</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span>
<span style="color: #bc6ec5; font-weight: bold;">heronC</span> n a
  <span style="color: #7590db;">|</span>n <span style="color: #7590db;">&gt;</span> 0      <span style="color: #7590db;">=</span> (x <span style="color: #7590db;">+</span> a<span style="color: #7590db;">/</span>x)<span style="color: #7590db;">/</span>2
  <span style="color: #7590db;">|</span>otherwise  <span style="color: #7590db;">=</span> a
  <span style="color: #4f97d7; font-weight: bold;">where</span> x <span style="color: #7590db;">=</span> heronC (n<span style="color: #7590db;">-</span>1) a
</pre>
</div>

<p>
fib &amp; where
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">fibA</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
<span style="color: #bc6ec5; font-weight: bold;">fibA</span> n
  <span style="color: #7590db;">|</span>n <span style="color: #7590db;">==</span> 0    <span style="color: #7590db;">=</span> 0
  <span style="color: #7590db;">|</span>n <span style="color: #7590db;">==</span> 1    <span style="color: #7590db;">=</span> 1
  <span style="color: #7590db;">|</span>otherwise <span style="color: #7590db;">=</span> x <span style="color: #7590db;">+</span>y
  <span style="color: #4f97d7; font-weight: bold;">where</span>
    x <span style="color: #7590db;">=</span> fibA (n<span style="color: #7590db;">-</span>1)
    y <span style="color: #7590db;">=</span> fibA (n<span style="color: #7590db;">-</span>2)

</pre>
</div>

<p>
fib &amp; where &amp; pattern matching
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">fibB</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
<span style="color: #bc6ec5; font-weight: bold;">fibB</span> 0 <span style="color: #7590db;">=</span> 0
<span style="color: #bc6ec5; font-weight: bold;">fibB</span> 1 <span style="color: #7590db;">=</span> 1
<span style="color: #bc6ec5; font-weight: bold;">fibB</span> n <span style="color: #7590db;">=</span> fibB (n<span style="color: #7590db;">-</span>1) <span style="color: #7590db;">+</span> fibB (n<span style="color: #7590db;">-</span>2)


<span style="color: #bc6ec5; font-weight: bold;">fibC</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Int</span>
<span style="color: #bc6ec5; font-weight: bold;">fibC</span> 0 <span style="color: #7590db;">=</span> 0
<span style="color: #bc6ec5; font-weight: bold;">fibC</span> 1 <span style="color: #7590db;">=</span> 1
<span style="color: #bc6ec5; font-weight: bold;">fibC</span> n
  <span style="color: #7590db;">|</span> n <span style="color: #7590db;">&lt;</span> 0      <span style="color: #7590db;">=</span> error <span style="color: #2d9574;">"illegal arguement"</span>
  <span style="color: #7590db;">|</span> otherwise  <span style="color: #7590db;">=</span> fibB (n<span style="color: #7590db;">-</span>1) <span style="color: #7590db;">+</span> fibB (n<span style="color: #7590db;">-</span>2)


(<span style="color: #bc6ec5; font-weight: bold;">&lt;##&gt;</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Double</span>
0 <span style="color: #7590db;">&lt;##&gt;</span> a   <span style="color: #7590db;">=</span> a
n <span style="color: #bc6ec5; font-weight: bold;">&lt;##&gt;</span> a  
  <span style="color: #7590db;">|</span> n <span style="color: #7590db;">&gt;</span> 0  <span style="color: #7590db;">=</span> (x <span style="color: #7590db;">+</span> a<span style="color: #7590db;">/</span>x)<span style="color: #7590db;">/</span>2
  <span style="color: #7590db;">|</span> otherwise  <span style="color: #7590db;">=</span> error <span style="color: #2d9574;">"illegal arguement"</span>
  <span style="color: #4f97d7; font-weight: bold;">where</span> x <span style="color: #7590db;">=</span> (n<span style="color: #7590db;">-</span>1) <span style="color: #7590db;">&lt;##&gt;</span> a
</pre>
</div>
</div>
</div>

<div id="outline-container-org42b308f" class="outline-3">
<h3 id="org42b308f">type conversion</h3>
<div class="outline-text-3" id="text-org42b308f">
<p>
Guides
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">vielleichtdreifach</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Bool</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>
<span style="color: #bc6ec5; font-weight: bold;">vielleichtdreifach</span> verdreifach nochmal n
  <span style="color: #7590db;">|</span> verdreifach <span style="color: #7590db;">&amp;&amp;</span> nochmal <span style="color: #7590db;">=</span> maldrei ( maldrei n)
  <span style="color: #7590db;">|</span> verdreifach            <span style="color: #7590db;">=</span> maldrei n
  <span style="color: #7590db;">|</span> otherwise              <span style="color: #7590db;">=</span> n
  <span style="color: #4f97d7; font-weight: bold;">where</span> maldrei n <span style="color: #7590db;">=</span> 3<span style="color: #7590db;">*</span>n 

<span style="color: #bc6ec5; font-weight: bold;">dreifach</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>
<span style="color: #bc6ec5; font-weight: bold;">dreifach</span> <span style="color: #7590db;">=</span> vielleichtdreifach <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">False</span> 

<span style="color: #bc6ec5; font-weight: bold;">neudreifach</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>
<span style="color: #bc6ec5; font-weight: bold;">neudreifach</span> <span style="color: #7590db;">=</span> vielleichtdreifach <span style="color: #ce537a; font-weight: bold;">True</span> <span style="color: #ce537a; font-weight: bold;">True</span>

</pre>
</div>
<p>
vielleichtdreifach Bool Bool -&gt; Integer
</p>
</div>
</div>

<div id="outline-container-orgb713382" class="outline-3">
<h3 id="orgb713382">Factorial</h3>
<div class="outline-text-3" id="text-orgb713382">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #bc6ec5; font-weight: bold;">fac</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>
<span style="color: #bc6ec5; font-weight: bold;">fac</span> n
  <span style="color: #7590db;">|</span> n <span style="color: #7590db;">==</span> 0  <span style="color: #7590db;">=</span> 1
  <span style="color: #7590db;">|</span> otherwise <span style="color: #7590db;">=</span> fac (n<span style="color: #7590db;">-</span>1) <span style="color: #7590db;">*</span> n
</pre>
</div>
</div>
</div>
