CS.html

<div id="outline-container-org5d02778" class="outline-3">
<h3 id="org5d02778">Stern Brocot Floge</h3>
<div class="outline-text-3" id="text-org5d02778">
<p>
\(\\s_{0} = 0 \\ s_{1} = 1 \\ s_{2n} = s_{n} \\ s_{2n+1} = s_{n} + s_{n+1}\)
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #bc6ec5; font-weight: bold;">*/*</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>
(<span style="color: #bc6ec5; font-weight: bold;">*/*</span>) <span style="color: #7590db;">=</span> div

(<span style="color: #bc6ec5; font-weight: bold;">*%*</span>) <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>
(<span style="color: #bc6ec5; font-weight: bold;">*%*</span>) <span style="color: #7590db;">=</span> rem

<span style="color: #bc6ec5; font-weight: bold;">sternBrocot</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>
<span style="color: #bc6ec5; font-weight: bold;">sternBrocot</span> n
  <span style="color: #7590db;">|</span> n <span style="color: #7590db;">==</span> 0      <span style="color: #7590db;">=</span> 0
  <span style="color: #7590db;">|</span> n <span style="color: #7590db;">==</span> 1      <span style="color: #7590db;">=</span> 1
  <span style="color: #7590db;">|</span> n <span style="color: #7590db;">*%*</span> 2 <span style="color: #7590db;">==</span> 0 <span style="color: #7590db;">=</span> sternBrocot half
  <span style="color: #7590db;">|</span> otherwise    <span style="color: #7590db;">=</span> sternBrocot half <span style="color: #7590db;">+</span> sternBrocot (half <span style="color: #7590db;">+</span> 1)
  <span style="color: #4f97d7; font-weight: bold;">where</span> half <span style="color: #7590db;">=</span> n <span style="color: #7590db;">*/*</span> 2

<span style="color: #bc6ec5; font-weight: bold;">suche</span> <span style="color: #7590db;">::</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">Integer</span>
<span style="color: #bc6ec5; font-weight: bold;">suche</span> suchziel postionziel
  <span style="color: #7590db;">|</span> sternBrocot postionziel <span style="color: #7590db;">&gt;</span> suchziel <span style="color: #7590db;">=</span> postionziel
  <span style="color: #7590db;">|</span> otherwise                          <span style="color: #7590db;">=</span> suche suchziel (postionziel <span style="color: #7590db;">+</span>1)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1010993" class="outline-2">
<h2 id="org1010993">Schaltnetze</h2>
</div>
<div id="outline-container-org3e2c907" class="outline-2">
<h2 id="org3e2c907">Hash</h2>
<div class="outline-text-2" id="text-org3e2c907">
<p>
Verlastungsfaktor  \[ &alpha; = \frac{n}{m} ]\
n : elementen
m : Hash Blukets
</p>

<p>
For Kollision
Offenes Hash :  mit verkertete List
Universumes Hash : mit ein hash famliy function
Geschlossens Hash : die weiter hash bluket besiten
verdoppelungsstrategie : verkleinen order vergrossen die Hash Blukets
</p>
</div>
</div>

<div id="outline-container-orgb65efc5" class="outline-2">
<h2 id="orgb65efc5">P &amp; NP</h2>
<div class="outline-text-2" id="text-orgb65efc5">
</div>
<div id="outline-container-org6830193" class="outline-3">
<h3 id="org6830193">def</h3>
<div class="outline-text-3" id="text-org6830193">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">P problem</td>
<td class="org-left">{L</td>
<td class="org-left">Es gibt ein Polynom p(n) und eine p(n)-Zeitbeschrankte DTM m mit L=L(m)}</td>
</tr>

<tr>
<td class="org-left">NP problem</td>
<td class="org-left">{L</td>
<td class="org-left">Es gibt ein Polynom p(n) und eine p(n)-Zeitbeschrankte NTM m mit L=L(m)}</td>
</tr>

<tr>
<td class="org-left">ExpTime problem</td>
<td class="org-left">{L</td>
<td class="org-left">Es gibt ein Polynom p(n) und eine 2<sup>p</sup>(n)-Zeitbeschrankte DTM m mit L=L(m)}</td>
</tr>
</tbody>
</table>

<p>
Rudction
Many-one-Rudction : alle  P Problem konnen auf one Problem reduzieren.
</p>
</div>
</div>

<div id="outline-container-org4ce4bea" class="outline-3">
<h3 id="org4ce4bea">NP</h3>
<div class="outline-text-3" id="text-org4ce4bea">
<p>
SAT &lt;- 3SAT &lt;- 3 Farbarkeit
            &lt;- Clique
            &lt;- Independent Set
            &lt;- Vertex Set
            Pa
</p>
</div>
</div>
</div>


<div id="outline-container-org199b848" class="outline-2">
<h2 id="org199b848">Algotithm</h2>
<div class="outline-text-2" id="text-org199b848">
</div>
<div id="outline-container-org5010445" class="outline-3">
<h3 id="org5010445">Komplexitätstheorie</h3>
<div class="outline-text-3" id="text-org5010445">
</div>
<div id="outline-container-org848ef4a" class="outline-4">
<h4 id="org848ef4a">Maximum Sequence Problem Beispile</h4>
<div class="outline-text-4" id="text-org848ef4a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">A1.</th>
<th scope="col" class="org-left">\(O(n^3)\)</th>
<th scope="col" class="org-left">Erschöpfende Suche/ Brute-Force-Suche/ Exhaustive Search</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A2.</td>
<td class="org-left">\(O(n^2)\)</td>
<td class="org-left">Zwischen Prozessen mehr anwenden</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">A3.</td>
<td class="org-left">\(O(n \log n)\)</td>
<td class="org-left">Rekursive</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">A4.</td>
<td class="org-left">\(O(n)\)</td>
<td class="org-left">Max Maxsuffix</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf0a6f59" class="outline-4">
<h4 id="orgf0a6f59">Landau Symbols</h4>
<div class="outline-text-4" id="text-orgf0a6f59">
<p>
\[ f = O(g) \leftrightarrow g = \Omega(f) \leftrightarrow \lim_{x \to
\infty} Sup|\frac{f(x)}{g(x)}| < \infty \]
</p>

<p>
\[ f = \Omega(g) \leftrightarrow g = O(f) \leftrightarrow \lim_{x \to
\infty} Inf|\frac{f(x)}{g(x)}| > 0 \]
</p>

<p>
\[ f = \Theta(g) \leftrightarrow g = \Theta(f) \leftrightarrow 0< \lim_{x \to
\infty} Inf|\frac{f(x)}{g(x)}| < \lim_{x \to \infty} Sup|\frac{f(x)}{g(x)}| < \infty \]
</p>
</div>
</div>

<div id="outline-container-orgdd8a146" class="outline-4">
<h4 id="orgdd8a146">Master Theorem</h4>
<div class="outline-text-4" id="text-orgdd8a146">
<p>
In a Recursive process, we can form this,  \[ T_n = a \cdot T(\frac{n}{b}) + f(n) \],
for  \(a \geq 1\), \(b \geq 1\). T 代表递归符号,   a: 每次递归成几个部分,
n/b: 递归后每个部分的问题规模,  f(n): 递归后将所有部分融合的步骤, 作如
下变换：
</p>

<p>
\[ n^d = f(n) = O(n^{\log_b^a-\epsilon}) \\
   n^d = f(n)  \ge n^{\log_b^a-\epsilon} \\
   d \ge \log_b^a - \epsilon \\
   d \ge \log_b^a
\]
如果\(\log_b^b\) 在减去一个存在的 &epsilon; 后仍然大于d, 则 ：\(T_n = \Theta (n^{\log_b^a})\).
</p>


<p>
\[
  n^d = f(n) = \Theta (n^{\log_b^a}) \\
  n^d = f(n)  = n^{\log_b^a} \\
  d = \log_b^a
\]
如果$log<sub>b</sub><sup>a</sup> 恒等于 d, 则： \(T_n = \Theta (n^{\log_b^a} \cdot \lg^n)\)
</p>


<p>
\[
   n^d = f(n) = \Omega(n^{\log_b^a+\epsilon}) \\
   n^d = f(n)  \le n^{\log_b^a+\epsilon} \\
   d \le \log_b^a +\epsilon \\
   d \le \log_b^a
\]
如果\(\log_b^b\) 在加上一个存在的 &epsilon; 后仍然小于d, 则 ：\(T_n = \Theta (f(n))\).
</p>
</div>
</div>
</div>

<div id="outline-container-org6c2928a" class="outline-3">
<h3 id="org6c2928a">Tree Theorem</h3>
<div class="outline-text-3" id="text-org6c2928a">
</div>
<div id="outline-container-org593a3b8" class="outline-4">
<h4 id="org593a3b8">Vorgänger(u)</h4>
<div class="outline-text-4" id="text-org593a3b8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">if least(root) = u</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">no Vorgänger</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">if u.L exits</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">greatest(u.L)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">if u.L not exits</td>
<td class="org-left">u is right child</td>
<td class="org-left">father node</td>
</tr>

<tr>
<td class="org-left">if u.L not exits</td>
<td class="org-left">u is left child</td>
<td class="org-left">(grand)father which has right child</td>
</tr>
</tbody>
</table>
</div>
</div>
