CS.org
*** Nachfolger(v)

|-----------------------+------------------+------------------------------------|
| if greatest(root) = v |                  | no Nachfolger                      |
|-----------------------+------------------+------------------------------------|
| if v.R exits          |                  | least(u.L)                         |
|-----------------------+------------------+------------------------------------|
| if v.R not exits      | v is left child  | father node                        |
| if v.R not exits      | v is right child | (grand)father which has left child |
|-----------------------+------------------+------------------------------------|
* Advanced Algorithms
** Master theorem
** Maximum increasing Subsequence
It has three different solution,
*** LCS C++
*** LCS python
*** Dynamic program C++
#+begin_src C++ :results output
#include <iostream>  
using namespace std;  
#define len(a) (sizeof(a) / sizeof(a[0])) //数组长度  
int lis(int arr[], int len)  
{  
    int longest[len];  
    for (int i=0; i<len; i++)  
        longest[i] = 1;  
  
    for (int j=1; j<len; j++) {  
        for (int i=0; i<j; i++) {  
            if (arr[j]>arr[i] && longest[j]<longest[i]+1){ //注意longest[j]<longest[i]+1这个条件，不能省略。  
                longest[j] = longest[i] + 1; //计算以arr[j]结尾的序列的最长递增子序列长度  
            }  
        }  
    }  
  
    int max = 0;  
    for (int j=0; j<len; j++) {  
        cout << "longest[" << j << "]=" << longest[j] << endl;  
        if (longest[j] > max) max = longest[j];  //从longest[j]中找出最大值  
    }  
    return max;  
}  
  
int main()  
{  
    int arr[] = {1, 4, 5, 6, 2, 3, 8}; //测试数组  
    int ret = lis(arr, len(arr));  
    cout << "max increment substring len=" << ret << endl;  
    return 0;  
}  
#+end_src

#+RESULTS:
: longest[0]=1
: longest[1]=2
: longest[2]=3
: longest[3]=4
: longest[4]=2
: longest[5]=3
: longest[6]=5
: max increment substring len=5

*** Dynamic Program Python
#+begin_src python :results output
list1 = [2, 1, 3, 45, 76, 89, 457, 54, 4, 5, 3, 6, 7, 8, 4, 9]
l = len(list1)
a = [1]*l
b = [[] for x in range(l)]


for i in range(l):
    for j in range(i):
        if (list1[i] > list1[j]) and (a[i] < (a[j] + 1)):
            a[i] = a[j]+1
            b[i].append(list1[j])
    b[i].append(list1[i])

print(a)
maxa = a.index(max(a))
print("the maximun length of LIS of list1 is {}".format(max(a)))
print("the LIS is {}".format(b[maxa]))


#+end_src

#+RESULTS:
: [1, 1, 2, 3, 4, 5, 6, 4, 3, 4, 2, 5, 6, 7, 3, 8]
: the maximun length of LIS of list1 is 8
: the LIS is [2, 3, 4, 5, 6, 7, 8, 9]

