CS.html

<div id="outline-container-orgcb4f0c4" class="outline-4">
<h4 id="orgcb4f0c4">Nachfolger(v)</h4>
<div class="outline-text-4" id="text-orgcb4f0c4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">if greatest(root) = v</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">no Nachfolger</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">if v.R exits</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">least(u.L)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">if v.R not exits</td>
<td class="org-left">v is left child</td>
<td class="org-left">father node</td>
</tr>

<tr>
<td class="org-left">if v.R not exits</td>
<td class="org-left">v is right child</td>
<td class="org-left">(grand)father which has left child</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-org47fd5b8" class="outline-2">
<h2 id="org47fd5b8">Advanced Algorithms</h2>
<div class="outline-text-2" id="text-org47fd5b8">
</div>
<div id="outline-container-org0336e2c" class="outline-3">
<h3 id="org0336e2c">Master theorem</h3>
</div>
<div id="outline-container-orge5128f3" class="outline-3">
<h3 id="orge5128f3">Maximum increasing Subsequence</h3>
<div class="outline-text-3" id="text-orge5128f3">
<p>
It has three different solution,
</p>
</div>
<div id="outline-container-org07e142b" class="outline-4">
<h4 id="org07e142b">LCS C++</h4>
</div>
<div id="outline-container-orgec07688" class="outline-4">
<h4 id="orgec07688">LCS python</h4>
</div>
<div id="outline-container-org30fc1a3" class="outline-4">
<h4 id="org30fc1a3">Dynamic program C++</h4>
<div class="outline-text-4" id="text-org30fc1a3">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;iostream&gt;</span>  
<span style="color: #4f97d7; font-weight: bold;">using</span> <span style="color: #4f97d7; font-weight: bold;">namespace</span> <span style="color: #a45bad;">std</span>;  
<span style="color: #bc6ec5;">#define</span> <span style="color: #bc6ec5; font-weight: bold;">len</span>(<span style="color: #7590db;">a</span>) (<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(a) / <span style="color: #4f97d7; font-weight: bold;">sizeof</span>(a[0])) <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#25968;&#32452;&#38271;&#24230;  </span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">lis</span>(<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">arr</span>[], <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">len</span>)  
{  
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">longest</span>[len];  
    <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>=0; i&lt;len; i++)  
        longest[i] = 1;  

    <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span>=1; j&lt;len; j++) {  
        <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>=0; i&lt;j; i++) {  
            <span style="color: #4f97d7; font-weight: bold;">if</span> (arr[j]&gt;arr[i] &amp;&amp; longest[j]&lt;longest[i]+1){ <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#27880;&#24847;longest[j]&lt;longest[i]+1&#36825;&#20010;&#26465;&#20214;&#65292;&#19981;&#33021;&#30465;&#30053;&#12290;  </span>
                longest[j] = longest[i] + 1; <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#35745;&#31639;&#20197;arr[j]&#32467;&#23614;&#30340;&#24207;&#21015;&#30340;&#26368;&#38271;&#36882;&#22686;&#23376;&#24207;&#21015;&#38271;&#24230;  </span>
            }  
        }  
    }  

    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">max</span> = 0;  
    <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">j</span>=0; j&lt;len; j++) {  
        cout &lt;&lt; <span style="color: #2d9574;">"longest["</span> &lt;&lt; j &lt;&lt; <span style="color: #2d9574;">"]="</span> &lt;&lt; longest[j] &lt;&lt; endl;  
        <span style="color: #4f97d7; font-weight: bold;">if</span> (longest[j] &gt; max) max = longest[j];  <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#20174;longest[j]&#20013;&#25214;&#20986;&#26368;&#22823;&#20540;  </span>
    }  
    <span style="color: #4f97d7; font-weight: bold;">return</span> max;  
}  

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>()  
{  
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">arr</span>[] = {1, 4, 5, 6, 2, 3, 8}; <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#27979;&#35797;&#25968;&#32452;  </span>
    <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">ret</span> = lis(arr, len(arr));  
    cout &lt;&lt; <span style="color: #2d9574;">"max increment substring len="</span> &lt;&lt; ret &lt;&lt; endl;  
    <span style="color: #4f97d7; font-weight: bold;">return</span> 0;  
}  
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0ca6b9" class="outline-4">
<h4 id="orgc0ca6b9">Dynamic Program Python</h4>
<div class="outline-text-4" id="text-orgc0ca6b9">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">list1</span> = [2, 1, 3, 45, 76, 89, 457, 54, 4, 5, 3, 6, 7, 8, 4, 9]
<span style="color: #7590db;">l</span> = <span style="color: #4f97d7;">len</span>(list1)
<span style="color: #7590db;">a</span> = [1]*l
<span style="color: #7590db;">b</span> = [[] <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(l)]


<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(l):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> j <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(i):
        <span style="color: #4f97d7; font-weight: bold;">if</span> (list1[i] &gt; list1[j]) <span style="color: #4f97d7; font-weight: bold;">and</span> (a[i] &lt; (a[j] + 1)):
            <span style="color: #7590db;">a</span>[i] = a[j]+1
            b[i].append(list1[j])
<span style="background-color: #292e34;"> </span>   b[i].append(list1[i])

<span style="color: #4f97d7; font-weight: bold;">print</span>(a)
<span style="color: #7590db;">maxa</span> = a.index(<span style="color: #4f97d7;">max</span>(a))
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the maximun length of LIS of list1 is {}"</span>.<span style="color: #4f97d7;">format</span>(<span style="color: #4f97d7;">max</span>(a)))
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"the LIS is {}"</span>.<span style="color: #4f97d7;">format</span>(b[maxa]))


</pre>
</div>
</div>
</div>
