CS.org
*** O(nlogn) method C++
#+begin_src C++ :results output
#include <stdio.h>  
#include <stdlib.h>  
#include <string.h>  

#define N 9 //数组元素个数  
int array[N] = {2, 1, 6, 3, 5, 4, 8, 7, 9}; //原数组  
int B[N]; //在动态规划中使用的数组,用于记录中间结果,其含义三言两语说不清,请参见博文的解释  
int len; //用于标示B数组中的元素个数  

int LIS(int *array, int n); //计算最长递增子序列的长度,计算B数组的元素,array[]循环完一遍后,B的长度len即为所求  
int BiSearch(int *b, int len, int w); //做了修改的二分搜索算法  

int main()  
{
    
  printf("LIS: %d\n", LIS(array, N));  
      
  int i;  
  for(i=0; i<len; ++i)  
    {  
      printf("B[%d]=%d\n", i, B[i]);  
    }  

  return 0;  
}  

int LIS(int *array, int n)  
{  

  len = 1;  
  B[0] = array[0];  
  int i, pos = 0;
  int *lis =(int *) malloc(n*sizeof(int));
      
  lis[0] = array[0];
  for(i=1; i<n; ++i)  
    {  
      if(array[i] > B[len-1]) //如果大于B中最大的元素，则直接插入到B数组末尾  
	{  
	  B[len] = array[i];  
	  ++len;
	  lis[i] = array[i]; 
	}  
      else  
	{  
	  pos = BiSearch(B, len, array[i]); //二分查找需要插入的位置
	  lis[pos] = array[i];
	  B[pos] = array[i];  
	}
    }  

  printf("the LIS is :\n");
  for (int i = 0; i < n; ++i) {
    printf("%d ",lis[i]);
  }
  free(lis);
  printf(" \n");
  
  return len;  
}  

//修改的二分查找算法，返回数组元素需要插入的位置。  
int BiSearch(int *b, int len, int w)  
{  
  int left = 0, right = len - 1;  
  int mid;  
  while (left <= right)  
    {  
      mid = left + (right-left)/2;  
      if (b[mid] > w)  
	right = mid - 1;  
      else if (b[mid] < w)  
	left = mid + 1;  
      else    //找到了该元素，则直接返回  
	return mid;  
    }  
  return left;//数组b中不存在该元素，则返回该元素应该插入的位置  
}  




#+end_src

#+RESULTS:
: the LIS is :
: 1 3 4 7 5 0 8 0 9  
: LIS: 5
: B[0]=1
: B[1]=3
: B[2]=4
: B[3]=7
: B[4]=9


*** O(nlogn) method Python
#+begin_src python :results output
list1 = [2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9]
l = len(list1)


def getpos(list2, n, x):  # binary search of postion
    left = 0
    right = n-1
    while (left <= right):
        mid = int(left + (right-left)/2)
        if x < list1[mid]:
            right = mid-1
        elif x > list1[mid]:
            left = mid + 1
        else:
            return mid
    return left


c = [list1[0]]  # copy the first element to c

for i in range(1, l):
    if c[-1] < list1[i]:  # if the new element is bigger than the last c, add it
        c.append(list1[i])
    else:
        pos = getpos(c, len(c), list1[i])  # if not, find the right pos
        c[pos-1] = list1[i]

print(c)

#+end_src

#+RESULTS:
: [1, 3, 4, 5, 6, 7, 8, 9]

** maximum submatrix
