CS.html

<div id="outline-container-org7d42da0" class="outline-4">
<h4 id="org7d42da0">O(nlogn) method C++</h4>
<div class="outline-text-4" id="text-org7d42da0">
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdio.h&gt;</span>  
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;stdlib.h&gt;</span>  
<span style="color: #bc6ec5;">#include</span> <span style="color: #2d9574;">&lt;string.h&gt;</span>  

<span style="color: #bc6ec5;">#define</span> <span style="color: #7590db;">N</span> 9 <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#25968;&#32452;&#20803;&#32032;&#20010;&#25968;  </span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">array</span>[N] = {2, 1, 6, 3, 5, 4, 8, 7, 9}; <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#21407;&#25968;&#32452;  </span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">B</span>[N]; <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#22312;&#21160;&#24577;&#35268;&#21010;&#20013;&#20351;&#29992;&#30340;&#25968;&#32452;,&#29992;&#20110;&#35760;&#24405;&#20013;&#38388;&#32467;&#26524;,&#20854;&#21547;&#20041;&#19977;&#35328;&#20004;&#35821;&#35828;&#19981;&#28165;,&#35831;&#21442;&#35265;&#21338;&#25991;&#30340;&#35299;&#37322;  </span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">len</span>; <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#29992;&#20110;&#26631;&#31034;B&#25968;&#32452;&#20013;&#30340;&#20803;&#32032;&#20010;&#25968;  </span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">LIS</span>(<span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">array</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>); <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#35745;&#31639;&#26368;&#38271;&#36882;&#22686;&#23376;&#24207;&#21015;&#30340;&#38271;&#24230;,&#35745;&#31639;B&#25968;&#32452;&#30340;&#20803;&#32032;,array[]&#24490;&#29615;&#23436;&#19968;&#36941;&#21518;,B&#30340;&#38271;&#24230;len&#21363;&#20026;&#25152;&#27714;  </span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">BiSearch</span>(<span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">b</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">len</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">w</span>); <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#20570;&#20102;&#20462;&#25913;&#30340;&#20108;&#20998;&#25628;&#32034;&#31639;&#27861;  </span>

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">main</span>()  
{

  printf(<span style="color: #2d9574;">"LIS: %d\n"</span>, LIS(array, N));  

  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>;  
  <span style="color: #4f97d7; font-weight: bold;">for</span>(i=0; i&lt;len; ++i)  
    {  
      printf(<span style="color: #2d9574;">"B[%d]=%d\n"</span>, i, B[i]);  
    }  

  <span style="color: #4f97d7; font-weight: bold;">return</span> 0;  
}  

<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">LIS</span>(<span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">array</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">n</span>)  
{  

  len = 1;  
  B[0] = array[0];  
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span>, <span style="color: #7590db;">pos</span> = 0;
  <span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">lis</span> =(<span style="color: #ce537a; font-weight: bold;">int</span> *) malloc(n*<span style="color: #4f97d7; font-weight: bold;">sizeof</span>(<span style="color: #ce537a; font-weight: bold;">int</span>));

  lis[0] = array[0];
  <span style="color: #4f97d7; font-weight: bold;">for</span>(i=1; i&lt;n; ++i)  
    {  
      <span style="color: #4f97d7; font-weight: bold;">if</span>(array[i] &gt; B[len-1]) <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#22823;&#20110;B&#20013;&#26368;&#22823;&#30340;&#20803;&#32032;&#65292;&#21017;&#30452;&#25509;&#25554;&#20837;&#21040;B&#25968;&#32452;&#26411;&#23614;  </span>
        {  
          B[len] = array[i];  
          ++len;
          lis[i] = array[i]; 
        }  
      <span style="color: #4f97d7; font-weight: bold;">else</span>  
        {  
          pos = BiSearch(B, len, array[i]); <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#20108;&#20998;&#26597;&#25214;&#38656;&#35201;&#25554;&#20837;&#30340;&#20301;&#32622;</span>
          lis[pos] = array[i];
          B[pos] = array[i];  
        }
    }  

  printf(<span style="color: #2d9574;">"the LIS is :\n"</span>);
  <span style="color: #4f97d7; font-weight: bold;">for</span> (<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">i</span> = 0; i &lt; n; ++i) {
    printf(<span style="color: #2d9574;">"%d "</span>,lis[i]);
  }
  free(lis);
  printf(<span style="color: #2d9574;">" \n"</span>);

  <span style="color: #4f97d7; font-weight: bold;">return</span> len;  
}  

<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#20462;&#25913;&#30340;&#20108;&#20998;&#26597;&#25214;&#31639;&#27861;&#65292;&#36820;&#22238;&#25968;&#32452;&#20803;&#32032;&#38656;&#35201;&#25554;&#20837;&#30340;&#20301;&#32622;&#12290;  </span>
<span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">BiSearch</span>(<span style="color: #ce537a; font-weight: bold;">int</span> *<span style="color: #7590db;">b</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">len</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">w</span>)  
{  
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">left</span> = 0, <span style="color: #7590db;">right</span> = len - 1;  
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">mid</span>;  
  <span style="color: #4f97d7; font-weight: bold;">while</span> (left &lt;= right)  
    {  
      mid = left + (right-left)/2;  
      <span style="color: #4f97d7; font-weight: bold;">if</span> (b[mid] &gt; w)  
        right = mid - 1;  
      <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> (b[mid] &lt; w)  
        left = mid + 1;  
      <span style="color: #4f97d7; font-weight: bold;">else</span>    <span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#25214;&#21040;&#20102;&#35813;&#20803;&#32032;&#65292;&#21017;&#30452;&#25509;&#36820;&#22238;  </span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> mid;  
    }  
  <span style="color: #4f97d7; font-weight: bold;">return</span> left;<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">&#25968;&#32452;b&#20013;&#19981;&#23384;&#22312;&#35813;&#20803;&#32032;&#65292;&#21017;&#36820;&#22238;&#35813;&#20803;&#32032;&#24212;&#35813;&#25554;&#20837;&#30340;&#20301;&#32622;  </span>
}  




</pre>
</div>
</div>
</div>


<div id="outline-container-org526db05" class="outline-4">
<h4 id="org526db05">O(nlogn) method Python</h4>
<div class="outline-text-4" id="text-org526db05">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">list1</span> = [2, 1, 3, 4, 5, 3, 6, 7, 8, 4, 9]
<span style="color: #7590db;">l</span> = <span style="color: #4f97d7;">len</span>(list1)


<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">getpos</span>(list2, n, x):  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">binary search of postion</span>
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">left</span> = 0
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">right</span> = n-1
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">while</span> (left &lt;= right):
        <span style="color: #7590db;">mid</span> = <span style="color: #4f97d7;">int</span>(left + (right-left)/2)
        <span style="color: #4f97d7; font-weight: bold;">if</span> x &lt; list1[mid]:
            <span style="color: #7590db;">right</span> = mid-1
        <span style="color: #4f97d7; font-weight: bold;">elif</span> x &gt; list1[mid]:
            <span style="color: #7590db;">left</span> = mid + 1
        <span style="color: #4f97d7; font-weight: bold;">else</span>:
            <span style="color: #4f97d7; font-weight: bold;">return</span> mid
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">return</span> left


<span style="color: #7590db;">c</span> = [list1[0]]  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">copy the first element to c</span>

<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1, l):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">if</span> c[-1] &lt; list1[i]:  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if the new element is bigger than the last c, add it</span>
        c.append(list1[i])
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">else</span>:
        <span style="color: #7590db;">pos</span> = getpos(c, <span style="color: #4f97d7;">len</span>(c), list1[i])  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">if not, find the right pos</span>
        <span style="color: #7590db;">c</span>[pos-1] = list1[i]

<span style="color: #4f97d7; font-weight: bold;">print</span>(c)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgef7b42c" class="outline-3">
<h3 id="orgef7b42c">maximum submatrix</h3>
<div class="outline-text-3" id="text-orgef7b42c">
</div>
