CS.org
***  Brute force solution Python
#+begin_src python :results output
  import random
  l = 6
  a = [[]]*l
  gsm = [[]]*l
  for i in range(l):
      a[i] = [random.randint(-5, 5) for x in range(l)]

  print("Original random matrix  \n")
  for i in range(l):
      for j in range(l):
          print("{:>4d}".format(a[i][j]), end="")
      print("\n")

  max = 0

  # distance between x dimension of submatrix
  for i in range(1, l):
      for xstart in range(i-1, l):                            # x start  of submatrix
          for xstop in range(i+xstart, l+1-i+1):              # x stop    of submatrix
              # distance between y dimension of submatrix
              for j in range(1, l):
                  for ystart in range(j-1, l):                 # y start of submatrix
                      for ystop in range(j+ystart, l+1-j+1):   # y stop of submatrix
                          lip = [[] for x in range(l)]
                          count = 0
                          for x in range(xstart, xstop):
                              for y in range(ystart, ystop):
                                  lip[x].append(a[x][y])
                                  count += a[x][y]
                          if count > max:
                              lipmax = [[] for x in range(l)]
                              max = count
                              lipmax = lip
  print("maximux submatrix :\n")
  for i in range(len(lipmax)):
      print("\n")
      for j in lipmax[i]:
          print("{:>4d}".format(j), end="")

  print("\n")
  print("The summary is ", max)

#+end_src

#+RESULTS:
#+begin_example
Original random matrix  

   5   4  -4   3   4   4

   4  -5  -4  -2  -5  -4

   2  -2   4  -2  -3  -1

  -3   5   4   1   4  -2

   0  -4  -2  -1   4   2

  -3   4  -2   5  -1   0

maximux submatrix :









   5   4   1   4

  -4  -2  -1   4

   4  -2   5  -1

The summary is  17
#+end_example

            
