CS.html
<div id="outline-container-orge4723f2" class="outline-4">
<h4 id="orge4723f2">Brute force solution Python</h4>
<div class="outline-text-4" id="text-orge4723f2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> random
<span style="color: #7590db;">l</span> = 6
<span style="color: #7590db;">a</span> = [[]]*l
<span style="color: #7590db;">gsm</span> = [[]]*l
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(l):
<span style="background-color: #292e34;"> </span>   <span style="color: #7590db;">a</span>[i] = [random.randint(-5, 5) <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(l)]

<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"Original random matrix  \n"</span>)
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(l):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> j <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(l):
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"{:&gt;4d}"</span>.<span style="color: #4f97d7;">format</span>(a[i][j]), end=<span style="color: #2d9574;">""</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"\n"</span>)

<span style="color: #4f97d7;">max</span> = 0

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">distance between x dimension of submatrix</span>
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1, l):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> xstart <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(i-1, l):                            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">x start  of submatrix</span>
        <span style="color: #4f97d7; font-weight: bold;">for</span> xstop <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(i+xstart, l+1-i+1):              <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">x stop    of submatrix</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">distance between y dimension of submatrix</span>
            <span style="color: #4f97d7; font-weight: bold;">for</span> j <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(1, l):
                <span style="color: #4f97d7; font-weight: bold;">for</span> ystart <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(j-1, l):                 <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">y start of submatrix</span>
                    <span style="color: #4f97d7; font-weight: bold;">for</span> ystop <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(j+ystart, l+1-j+1):   <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">y stop of submatrix</span>
                        <span style="color: #7590db;">lip</span> = [[] <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(l)]
                        <span style="color: #7590db;">count</span> = 0
                        <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(xstart, xstop):
                            <span style="color: #4f97d7; font-weight: bold;">for</span> y <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(ystart, ystop):
                                lip[x].append(a[x][y])
                                <span style="color: #7590db;">count</span> += a[x][y]
                        <span style="color: #4f97d7; font-weight: bold;">if</span> count &gt; <span style="color: #4f97d7;">max</span>:
                            <span style="color: #7590db;">lipmax</span> = [[] <span style="color: #4f97d7; font-weight: bold;">for</span> x <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(l)]
                            <span style="color: #4f97d7;">max</span> = count
                            <span style="color: #7590db;">lipmax</span> = lip
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"maximux submatrix :\n"</span>)
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span>(<span style="color: #4f97d7;">len</span>(lipmax)):
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"\n"</span>)
<span style="background-color: #292e34;"> </span>   <span style="color: #4f97d7; font-weight: bold;">for</span> j <span style="color: #4f97d7; font-weight: bold;">in</span> lipmax[i]:
        <span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"{:&gt;4d}"</span>.<span style="color: #4f97d7;">format</span>(j), end=<span style="color: #2d9574;">""</span>)

<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"\n"</span>)
<span style="color: #4f97d7; font-weight: bold;">print</span>(<span style="color: #2d9574;">"The summary is "</span>, <span style="color: #4f97d7;">max</span>)

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: silin</p>
<p class="date">Created: 2020-11-23 Mo 20:44</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
